W4D5/music_app/app/models/user.rb

  def self.find_by_credentials(email, password)
    @user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@email.com"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "2gDfBb3WBwNTHj1lyyVHVA"], ["updated_at", "2018-11-16 05:31:05.082883"], ["id", 3]]